[
    {
        "date": "2024",
        "event": "Fell in love with coding",
        "description": ""
    },
    {
        "date": "2023",
        "event": "Quarter life crisis",
        "description": ""
    },
    {
        "date": "2022",
        "event": "Started my Airbnb business",
        "description": ""
    },
    {
        "date": "2020",
        "event": "Continued tutoring...",
        "description": ""
    },
    {
        "date": "2020",
        "event": "Graduated from my master's",
        "description": ""
    },
    {
        "date": "2019",
        "event": "Worked @ UNICEF in NYC",
        "description": "Following two semesters of course work, I secured a 6-month internship at the UNICEF headquarters in NYC, working with the UN Girls' Education Initiative. It my truly a dream come true."
    },
    {
        "date": "2018",
        "event": "Started my master's @ Waterloo",
        "description": "A couple years later, I started my MA in Global Governance at Waterloo. This time, I was actually interested in what I was learning."
    },
    {
        "date": "2016",
        "event": "Graduated from undergrad",
        "description": "After graduating from Western, I continued running my tutoring business, but knew that I've wanted to pursue further education on international development..."
    },
    {
        "date": "2015",
        "event": "Worked in Kenya",
        "description": "In my final years of uni, I found an intense passion for global affairs. I was exposed to a side of social science entirely foreign to me--social justice issues. I went on a summer exchange/internship program to Kenya, and the experience completely shifted my perspective on the things that are truly important in life."
    },
    {
        "date": "2014",
        "event": "Started my online tutoring business",
        "description": "I quickly realized that I had no love for my major... but something I did love to do was to help others. In my third year, my friends encouraged me to start a tutoring business, leveraging my bi-lingual language skills to help Chinese international students."
    },
    {
        "date": "2011",
        "event": "Started my freshman year @ Western",
        "description": "When I was 17, I had no idea what I should do with my life. I had always excelled at maths and physics, but lived for creative self-expression; I wanted to be an architect but I was encouraged to go into a 'practical' field such as finance rather than engineering... Of my many acceptance letters, I chose to go to Western for Ivey."
    }
]